# DATA CLEANING

In [1]:
# Import files

In [2]:
import pandas as pd

In [3]:
pwd

'C:\\Users\\User\\OneDrive\\CLEAR\\3.A.PANDAS'

In [4]:
df = pd.read_csv('nba.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

In [6]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           1
Height        1
Weight        1
College      85
Salary       12
Bonus       457
Sales       457
dtype: int64

In [8]:
df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0,NaN,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0,NaN,NaN
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN,NaN,NaN

In [9]:
df.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
454,Raul Neto,Utah Jazz,25.0,PG,24.0,06-Jan,179.0,NaN,900000.0,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,07-Mar,256.0,NaN,2900000.0,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,NaN,NaN

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

# INTENDATION

In [12]:
df[['Name']].shape

(457, 1)

In [14]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales'],
      dtype='object')

In [16]:
df[['Team', 'Position']].head(3)

             Team Position
0  Boston Celtics       PG
1  Boston Celtics       SF
2  Boston Celtics       SG

In [22]:
newdf = df[['Number', 'Height', 'Salary']]

In [23]:
newdf.head(3)

   Number  Height     Salary
0     0.0  06-Feb  7730337.0
1    99.0  06-Jun  6796117.0
2    30.0  06-May        NaN

In [29]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           0
Height        1
Weight        1
College      85
Salary        0
Bonus       457
Sales       457
dtype: int64

In [26]:
df['Salary'] = df['Salary'].fillna(0)

In [75]:
df[['Age']] = df[['Age']].fillna(0)

In [76]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
Bonus       float64
Sales       float64
dtype: object

In [77]:
df['College'] = df['College'].fillna("No College")

In [78]:
df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
Bonus       0
Sales       0
dtype: int64

In [79]:
df['Name'] = df['Name'].fillna("No Name")

In [80]:
df.head(5)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []

In [81]:
df['Name'] = df['Name'].fillna("No Name")

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      0 non-null      object
 1   Team      0 non-null      object
 2   Number    0 non-null      float64
 3   Position  0 non-null      object
 4   Age       0 non-null      float64
 5   Height    0 non-null      object
 6   Weight    0 non-null      float64
 7   College   0 non-null      object
 8   Salary    0 non-null      float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 0.0+ bytes

In [83]:
new_df = df.dropna()

In [84]:
new_df = df.isnull().sum()

In [85]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
Bonus       float64
Sales       float64
dtype: object

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      0 non-null      object
 1   Team      0 non-null      object
 2   Number    0 non-null      float64
 3   Position  0 non-null      object
 4   Age       0 non-null      float64
 5   Height    0 non-null      object
 6   Weight    0 non-null      float64
 7   College   0 non-null      object
 8   Salary    0 non-null      float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 0.0+ bytes

In [87]:
df.head(3)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []

In [88]:
df['Age'] = df['Age'].add(5)

In [89]:
df.head(4)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []

In [90]:
df['Age'] = df['Age'].sub(5)

In [91]:
df['Age'] = df['Age'].mul(5)

In [92]:
df['Age'] = df['Age'].div(5)

In [93]:
df[['Weight']] = df[['Weight']].add(20)

In [94]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales'],
      dtype='object')

In [96]:
df[['GoodName', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales']] = df[['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales']]

In [97]:
df.head(3)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales, GoodName]
Index: []